
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2024.1.163.1.8
# Date: 2024-08-01 09:37

# Copyright (C) 2013 - 2024 Efinix Inc. All rights reserved.

# Device: Ti60F225
# Project: efinity_board_test
# Timing Model: C4 (final)

# PLL Constraints
#################
create_clock -period 10.0000 pll_inst1_CLKOUT0
create_clock -period 7.8125 main_clock
create_clock -period 20.0000 pll_inst1_CLKOUT0 

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_rx}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_rx}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_tx}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_tx}]

# HSIO GPIO Constraints
#########################

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {pll_inst1_CLKOUT0}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {pll_inst1_CLKOUT0}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {main_clock}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {main_clock}]
